{"data":{"site":{"siteMetadata":{"title":"untitled blog","author":"Susana Fotu"}},"markdownRemark":{"id":"ac9a282a-9409-5da9-bf6e-ccbe90209da6","excerpt":"When it comes to being creative, I’ve  always  had high hopes and aspirations. But like the ♓️I am, I let myself get lazy and end up with lots of unfinished…","html":"<h4>When it comes to being creative, I’ve <em>always</em> had high hopes and aspirations.</h4>\n<p>But like the ♓️I am, I let myself get lazy and end up with lots of unfinished\nprojects: <em>I’m looking directly at an unfinished canvas as I type this.</em> </p>\n<p><img src=\"https://media1.tenor.com/images/b8cfc069b7f6b3c7b6479935d5bfa744/tenor.gif?itemid=4519756\" alt=\"lazy seal gif\"></p>\n<p>And in the off chance that I have a spurt of inspiration and drive to complete\nsomething for myself, I tend to become obsessive over the tiniest of details\nand <strong>spend hours</strong> trying to get something <em>just right</em>. Whoever said <em>you are your own worst enemy</em>\ncouldn’t have of been more right. </p>\n<p>With the creation of this blog, for example, I spent a couple <strong>hours</strong> alone trying to decide on a color palette —\nlooking for colors I liked that were also widely accessible. To accomplish this, I used a combination of\n<a href=\"http://colorsafe.co/\">Color Safe</a>, <a href=\"https://mycolor.space/\">Color Space</a>, <a href=\"http://paletton.com/\">Paletton</a>,\nand <a href=\"https://webaim.org/resources/contrastchecker/\">Web Aim Color Contrast Checker</a>. After spending a couple\nhours on a color palette alone, I was quickly burnt out on all work for this blog so I published and called it\nquits for the night. </p>\n<p>In the morning, I checked the blog to realize I hadn’t changed the favicon (something I was most excited about creating)\nto something of my own. </p>\n<p><img src=\"https://pm1.narvii.com/6294/52f5bc75583630946a5b06ef1df63b34f68e2950_128.jpg\" alt=\"Homer Simpson &#x22;doh&#x22;\"></p>\n<p>So to kill 2 birds with 1 stone, I decided that I would practice time-boxing myself and my advance Sketch skills\nby creating a favicon for myself. I knew that I wanted the icon to be a 🍍 — pineapples have been a symbolic part\nof my life for some years now — but I was unsure of how I wanted the icon to look and feel. </p>\n<h4>Getting down to business to create a favicon</h4>\n<p><strong>First time-box</strong>: drawing a pineapple icon I liked.\nTo accomplish this task, I gave myself 10 minutes to roughly sketch something out. Within the time constraints, I was\nable to create a pencil version of a pineapple I actually liked quite a bit. </p>\n<p>I somewhat cheated after my allotted time, and used up another 5min to color the drawing in so I would have more\nreference when transforming the drawing into an icon. This is the finalized drawing: </p>\n<p><img src=\"https://i.imgur.com/KtClT8X.png\" alt=\"my first pineapple drawing\"></p>\n<p>With a drawing I was happy with, I was ready to open up Sketch and getting to vectorizing! </p>\n<p><strong>Second time-box</strong>: excercising my Sketch skills.\nTo create my icon, I chose Sketch because it’s a standard tool that UX designers at Target use and because\nI know it to be new user-friendly. In college, though I created a handful of websites from the ground up, the\nteams I was on were never concerned with — or given an opportunity to —fully explore design and user experience,\nso I never had much opportunity to learn design toolings. </p>\n<p>I went through a <a href=\"https://medium.com/sketch-app-sources/how-to-use-sketch-to-build-great-icons-9c3d982ae91d\">Sketch icon tutorial by Christian Krammeron</a>\nto get a better idea of the tools I could use and where to even start. Knowing that I would be learning Sketch\nas I attempted to vectorize my drawing, I gave myself a time-box of 1 hour and still fumbled around a lot of that hour.</p>\n<p>This the icon I created at the end of that hour: </p>\n<p><img src=\"https://i.imgur.com/njeS3bft.png?1\" alt=\"my first draft of the pineapple icon made using Sketch\"></p>\n<p>From that exercise I experienced a lot of pain points in how I was using Sketch: </p>\n<p>🎨 For the crown, I used the vector tool to draw individual points that I connected with rounded edges rather than\nusing a shape tool to get uniformity off the bat<br>\n🎨 I created all the lines on the body and then one-by-one curved them<br>\n🎨 The fill tool wasn’t giving me the right blend and overall feel I was hoping for</p>\n<p><strong>Third time’s a charm?</strong><br>\nI was not very pleased with my first pineapple iteration, and particularly not happy with how Sketch plays with color blends.\nI pivoted my pineapple design to be more minimalist and cohesive with the color palette I chose for this blog.</p>\n<p>Instead of using the vector tool to draw out the crown, I chose to use the star tool to create the size I wanted and then\nrounded out the stars edges and curved the connecting lines. </p>\n<p>For the minimalist look, I stripped out all fill colors and changed the color of the pineapple line to be #1ca086 <img src=\"https://placehold.it/15/1ca086/000000?text=+\" alt=\"#1ca086\"> </p>","frontmatter":{"title":"I made a favicon using Sketch","date":"January 28, 2019"}}},"pageContext":{"slug":"/i-made-a-favicon/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Obligatory \"Hello World\" post"}},"next":{"fields":{"slug":"/Tech-Intersections/"},"frontmatter":{"title":"Tech Intersections 2019"}}}}