{"data":{"site":{"siteMetadata":{"title":"untitled blog","author":"Susana Fotu"}},"markdownRemark":{"id":"dcbc2cf3-400b-510b-996d-c26dca60e502","excerpt":"Last weekend, I had the immense pleasure to attend  Tech Intersections \nhosted at my alma mater,  Mills College .  As described on the website:  Tech…","html":"<p>Last weekend, I had the immense pleasure to attend <a href=\"http://techintersections.org\">Tech Intersections</a>\nhosted at my alma mater, <a href=\"https://mills.edu\">Mills College</a>. </p>\n<p><img src=\"https://www.kaporcenter.org/wp-content/uploads/2018/11/techintersections.jpg\" alt=\"tech intersections banner\"></p>\n<p>As described on the website: </p>\n<blockquote>\n<p>Tech Intersections is an affordable conference for the womxn* of color most underrepresented in tech\nto come together and learn from each other’s successes, challenges, and experiences.</p>\n</blockquote>\n<p>Not only was this conference a chance to visit Mills — my second home — but it afforded me the opportunity\nto engage in a community within tech that I often feel starved of in Minnesota. This is not to say that my\ncurrent place of work isn’t inclusive or supportive, but that it’s vastly male. On my current team,\nI believe I was the <em>second</em> woman to join. And I joined a mere six months after the first woman joined.</p>\n<p>I knew going into the conference that I was going to be in <em>my community</em>, but I didn’t realize the emotional\nimpact that would have one me. As I entered campus gates, I immediately felt nostalgic. As I registered for the\nconference and saw a handful of powerful womxn I went to Mills with, I was overcome with feelings of empowerment\nand inspiration. </p>\n<p>It only got better as the day progressed. </p>\n<p>Before the opening keynote, breakfast was served and to grand amusement there was a <strong>mimosa bar</strong>. </p>\n<p><img src=\"https://media0.giphy.com/media/l4FGrc36ps3naFSow/giphy.gif\" alt=\"gif from Girls Trip movie where they are cheersing mimosas\"></p>\n<p>In the opening session, we heard from the <a href=\"https://www.cybercodetwins.com/\">Cyber Code Twins</a> and their journey from\nthe East L.A. projects to international hackathon fame. Their sheer, intoxicating joy and excitement is enough to\nmake anyone want to go out there and try to make a difference whether that be at hackathons or elsewhere. </p>\n<p>In addition to the Cyber Code Twins, the opening session also featured a music x tech piece by\n<a href=\"http://techintersections.org/speakers/briana-marela/\">Briana Marela</a> (a Mills College electronic art student). Perhaps my favorite part of the entire\nperformance was when Briana created sounds by flicking water into a bowl. The bowl, I believe, was equipped with\nsome kind of sensors which translated the density of the drops of water into different tones and intensities.</p>\n<hr>\n<p><sub><strong>*womxn</strong>: an intersectional reclaimation of the word “woman” meant to be inclusive of <em>all</em> individuals who\nidentify as womxn.\nsource:<a href=\"https://medium.com/@knottyvibescompany/intersectional-feminism-101-what-is-womxn-36c0a3140126\">Intersectional Feminism 101: What is Womxn?</a></sub></p>","frontmatter":{"title":"Tech Intersections 2019","date":"January 30, 2019"}}},"pageContext":{"slug":"/Tech-Intersections/","previous":{"fields":{"slug":"/i-made-a-favicon/"},"frontmatter":{"title":"I made a favicon using Sketch"}},"next":null}}