{"data":{"site":{"siteMetadata":{"title":"untitled blog","author":"Susana Fotu"}},"markdownRemark":{"id":"bff45015-7601-565b-bacc-818b71928d61","excerpt":"When it comes to being creative, I’ve  always  had high hopes and aspirations. But like the ♓️I am, I let myself get lazy and end up with lots of unfinished…","html":"<h4>When it comes to being creative, I’ve <em>always</em> had high hopes and aspirations.</h4>\n<p>But like the ♓️I am, I let myself get lazy and end up with lots of unfinished\nprojects: <em>I’m looking directly at an unfinished canvas as I type this.</em> </p>\n<p><img src=\"https://media1.tenor.com/images/b8cfc069b7f6b3c7b6479935d5bfa744/tenor.gif?itemid=4519756\" alt=\"lazy seal gif\"></p>\n<p>And in the off chance that I have a spurt of inspiration and drive to complete\nsomething for myself, I tend to become obsessive over the tiniest of details\nand <strong>spend hours</strong> trying to get something <em>just right</em>.  </p>\n<p>For this blog, I spent a couple hours alone trying to decide on a color palette —\nlooking for colors I liked that were also widely accessible. To accomplish this, I used a combination of\n<a href=\"http://colorsafe.co/\">Color Safe</a>, <a href=\"https://mycolor.space/\">Color Space</a>, <a href=\"http://paletton.com/\">Paletton</a>,\nand <a href=\"https://webaim.org/resources/contrastchecker/\">Web Aim Color Contrast Checker</a>. After spending a couple\nhours on a color palette alone, I was quickly burnt out on all work for this blog so I published and called it\nquits for the night. </p>\n<h4>In the morning, I checked the blog to realize I hadn’t changed the favicon to something of my own.</h4>\n<p><img src=\"https://pm1.narvii.com/6294/52f5bc75583630946a5b06ef1df63b34f68e2950_128.jpg\" alt=\"Homer Simpson &#x22;doh&#x22;\"></p>\n<p>I have never been great at time-boxing myself, but in that moment I realized that had I not gotten carried\naway with the color palette I might’ve remembered to update the favicon. </p>\n<p>So to kill 2 birds with 1 stone, I decided that I would practice time-boxing myself and my advance Sketch skills\nby creating a favicon for myself. I knew that I wanted the icon to be a 🍍 — pineapples have been a symbolic part\nof my life for some years now — but I was unsure of how I wanted the icon to look and feel. </p>","frontmatter":{"title":"I made a favicon using Sketch","date":"January 28, 2019"}}},"pageContext":{"slug":"/favicon/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Obligatory \"Hello World\" post"}},"next":null}}